#+TITLE: Memory Organizatin (Stack)
#+AUTHOR: Cristian Del Gobbo (pledged)
#+SUBTITLE: CSC 240 - Data Structures with C++ - Lyon College, Fall'24
#+STARTUP: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output

* Example: =Static= local variables
#+begin_src C
  // Without static (Demonstate locality of the variable);
  void count_calls(void){
    int call_count = 0;
    call_count++;
    printf("Function Called: %d time(s).\n", call_count); 
  }

  int main(){
    count_calls();
    count_calls();
    return 0;
  }
#+end_src

#+RESULTS:
: Function Called: 1 time(s).
: Function Called: 1 time(s).

#+begin_src C
  void count_calls(void){
    static int call_count = 0;
    call_count++;
    printf("Function Called: %d time(s).\n", call_count); 
  }

  int main(){
    count_calls();
    count_calls();
    return 0;
  }

#+end_src

#+RESULTS:
: Function Called: 1 time(s).
: Function Called: 2 time(s).

* Type Conversion
- Important: For any operation, the operands must be of the same
  size (same number of bits) and stored in the same way (same
  data type).

- Example of implicit type conversion.
#+begin_src C
  int i = 1;
  float x = 1.f;
  char c = 'a'; // ASCII value of 'a' is 97

  // Implicit type conversion
  double result = i + x + c; // all RHS operands converted to 'double'

  // Print the result
  printf("%g\n", result);

#+end_src

#+RESULTS:
: 99

* Explicit type conversion
#+begin_src C
int i = 1;
float x = 1.5f;
char c = 'a';

double result = i + x + c;

printf("Implicit Conversion: %g\n", result);

// Explicit conversion
result = (double)i + (double)x + (double)c;

printf("Explicit Conversion: %g", result);
#+end_src

#+RESULTS:
: Implicit Conversion: 99.5
: Explicit Conversion: 99.5

* Type definitions with =typedef=

- Define a Boolean with macro:
#+begin_src C
#define BOOL int

BOOL T = 1;
BOOL F = 0;
#+end_src

#+RESULTS:

- Do the same thing with =typedef=
#+begin_src C
typedef int bool; // define the type 'bool' as 'int'

bool flag;
#+end_src

#+RESULTS:

- Example: More informative, and more efficient
#+begin_src C 
typedef float Dollars; // you only have to change this

Dollars cash_in, cash_out;
#+end_src

- Example: You have a large warehouse program, and your variables
           need to be able to store product quantities in [0,50000]

If you want to use =int=, use =typedef= to define a new type:
#+begin_src C
typedef int Quantity;

Quantity q;
printf("Size of Quantity = %d", sizeof(q));

#+end_src

#+RESULTS:
: Size of Quantity = 4

- The =stdint.h= header library uses =typedef= to define names for integers
  with a specific number of bits - =int32_t= - for portability.

